# 1) Написать REST для блога (использовать валидацию). Реализовать
# модель Пост (название, содержание, дата публикации, автор, кол-во
# просмотров, тег). Реализовать модель тег. Реализовать модель автор (имя,
# фамилия, кол-во публикаций автора). Добавить валидацию ко всем полям.
# Реализовать модуль заполнения всех полей БД валидными (адеквадными
# данными :) ). Добавить вывод всех постов по тегу, при каждом обращении к
# конкретному посту увеличовать кол-во просмотров на 1. При обращении к
# автору, выводить все его публикации.